In [1]:
import pandas as pd
import numpy as np

In [2]:
v1 = pd.DataFrame({'Company':['HP','Apple','Dell','Lenovo','Samsung'],
                    'GC':['N','R','R','N','N'],'CI5':[1600,1700,np.nan,1900,2000], 'CI7':[2100,2200,2300,2400,2500]})
v1

      CI5   CI7  Company GC
0  1600.0  2100       HP  N
1  1700.0  2200    Apple  R
2     NaN  2300     Dell  R
3  1900.0  2400   Lenovo  N
4  2000.0  2500  Samsung  N

In [4]:
v2 = lambda x:x.CI7 > 2300
v1.groupby('Company').filter(v2)

      CI5   CI7  Company GC
3  1900.0  2400   Lenovo  N
4  2000.0  2500  Samsung  N

In [5]:
v3 = lambda x:x.CI5.isnull().sum() ==0
v1.groupby('Company').filter(v3)

      CI5   CI7  Company GC
0  1600.0  2100       HP  N
1  1700.0  2200    Apple  R
3  1900.0  2400   Lenovo  N
4  2000.0  2500  Samsung  N

In [7]:
v4 = lambda x:x.CI5.sum() ==0
v1.groupby('Company').filter(v4)

   CI5   CI7 Company GC
2  NaN  2300    Dell  R